const POST_COUNT = 25;

const MIN_LIKES = 15;
const MAX_LIKES = 200;

const MAX_COMMENTS = 20;
const POSITIVE_COMMENTS = ['Всё отлично!'];
const NEGATIVE_COMMENTS = [
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'
];

const DESCRIPTIONS = [
  'Чиллим на природе',
  'Это я на Марсе, сейчас дома уже',
  'Люблю понедельники',
  'Never Gonna Give You Up',
  '25 лет назад это было бы невозможно'
];

const NAMES = [
  'Владимир',
  'Виктор',
  'Юрий',
  'Николай',
  'Борис',
  'Анатолий'
];


export {POST_COUNT, MIN_LIKES, MAX_LIKES, MAX_COMMENTS, POSITIVE_COMMENTS, NEGATIVE_COMMENTS, DESCRIPTIONS, NAMES};
